src/Catalogs/Подсистемы/Подсистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Подсистемы</name>
  <predefined>
    <items>
      <name>СтандартныеПодсистемы</name>
      <description>СтандартныеПодсистемы</description>
    </items>
  </predefined>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Подсистемы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьПодсистемы();
	
КонецПроцедуры

Процедура ЗаполнитьПодсистемы()
	
	ОписатьПодсистему("СтандартныеПодсистемы", 
		"СтандартныеПодсистемы", "Стандартные подсистемы");
	
КонецПроцедуры

Процедура ОписатьПодсистему(ИмяПредопределенныхДанных, Наименование, Синоним) Экспорт
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Подсистемы." + ИмяПредопределенныхДанных);
	
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.Подсистемы.СоздатьЭлемент();
		Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
	КонецЕсли;
	
	Если Элемент.Наименование <> Наименование Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	
	Если Элемент.Синоним <> Синоним Тогда
		Элемент.Синоним = Синоним;
	КонецЕсли;
	
	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
